{
  "role": "designer / developer",
  "nyc": "NYC,",
  "home": "home",
  "projects": "projects",
  "about": "about",
  "homeScholar": "A scholar to the core, my boundless curiosity for understanding the intricacies of <b>human behavior</b> has been constant throughout all stages of my life.",
  "homeCreative": "Currently, it has led me to become a creative technologist that uses digital interactivity to explore <b>motivation and decision making</b>.",
  "homeProjects": "My latest projects have been centered on <b>communication of beliefs</b>.",
  "homeHobbies": "You can also find me exploring various art forms (currently, wheel throwing), indulging my pup with back scratches, or connecting with my siblings virtually over game nights.",
  "nyu": "NYU Tisch",
  "itp": "Interactive Telecommunication MPS",
  "unc": "UNC-CH",
  "psyc": "Psychology BS",
  "phil": "Philosophy BA",
  "ling": "Linguistics Minor",
  "coding": "coding",
  "softwares":"softwares",
  "code": "Designed in Figma and developed by me using Visual Studio Code. Built with React Three Fiber, animated with Framer Motion and Greensock Animation Platform. Routed with React Router and deployed via GitHub Pages. Typography includes the Roboto and Roboto Mono typefaces.",
  "tangibleValues": "tangible values",
  "creativeCoding": "creative coding",
  "interactive": "interactive",
  "tryIt": "try it",
  "tangibleDesc": "A digital gallery space for direct interaction with thought experiments, providing a dynamic environment for exploration and contemplation.",
  "tangibleAltCon": "This project went through many iterations. However, I knew I wanted to emulate an art gallery, with a focus on the presentation of thought experiments. So, I planned to make small scenes with a location marker and an interactive task.",
  "tangibleAltTech": "In the second iteration, I was more conscientious of what followed after making a decision, which led to animations based on what the counterpart computer-generated action was in each scenario.",
  "tangibleSum1": "I am an over-thinker, but for the most part, it is because I like thinking. I wanted to use this project to share a part of what I like and to create a space for you to think about various things as well. This project is an interactive website with 3D elements that showcase 4 thought experiments and allow for people to act upon the decision presented in each thought experiment prompt.",
  "tangibleSum2": "Traveling past the introductory foyer, you will come across an onboarding experience demonstrated through the Dictator Game. Upon completion, I invite you to freely navigate to areas presenting the Volunteer Dilemma, Exchange Game, and Trust Game. In each area, a floating diamond will be your point of contact, revealing the area’s respective thought experiment prompt and relaying instructions on completing the corresponding interactive component.",
  "tangibleSum3": "The goal of this project is to make the experience of thought experiments more engaging by improving the tangibility of values upheld whilst thinking through the various scenarios. The implementations I have made are centered around adding interactivity to conventionally written text, using technology to showcase this experience visually in a digital realm and representing decisions made with actions taken. In making values more tangible, hope to inspire reflection on what people care about and possible reasons behind their actions.",
  "tangibleCon1": "Why do I do the things I do? I deeply contemplate the motivations behind my behavior as a means of understanding myself, whether it’s an execution of values, an impulse of emotions, or a response to situational factors. These motives communicate both identity and tendencies, offering insights into the temporality of each passing state in which I exist. As such, I was happy to make a small part of that process - viewing actions as a window to our thoughts and feelings - a part of my project and share the same musings with other people.",
  "tangibleCon2": "I find particular interest in experimental games and thought dilemmas because they consist of base units of logic applicable across various contexts, while also yielding insights about a person in a light-hearted, hypothetical presentation. The controlled environment that thought experiments are depicted in minimizes the impact of situational factors and other persuasive contexts have on decision making. As a result, such decisions more closely represent our internal beliefs and typically take the form of an action in a situation.",
  "tangibleCon3": "However, the focus of the project, more broadly, is making the experience people have when engaging with thought experiments more robust. The implementations I have made to improve engagement are centered around adding interactivity to conventionally written text, using technology to showcase this experience visually in a digital realm and representing decisions made with actions taken. Through improving the tangibility of actions, these efforts give some tangibility to values upheld when thinking through the scenarios presented.",
  "tangibleTech": "This project is written in React Three Fiber and uses the React Three Rapier physics library. Animations are handled with GSAP. The loading screen was written in GLSL. Set in a 3rd person viewpoint, keyboard controls will be the primary method of engagement in this experience, along with some mouse interactivity."
}