{
  "general": {
    "role": "デザイナー / デベロッパー",
    "nyc": "ニューヨーク,",
    "home": "ホーム",
    "projects": "プロジェクト",
    "about": "アバウト",
    "homeScholar": "人生を通して、私は<b>人間行動</b>の複雑さを理解しようとする無限の好奇心を持ち続けてきました。",
    "homeCreative": "現在、この好奇心は私をクリエイティブテクノロジストへと導き、デジタルインタラクティビティを用いて<b>動機や意思決定</b>を探求しています。",
    "homeProjects": "私の最新プロジェクトは、<b>信念の伝達</b>を中心に展開されています。",
    "homeHobbies": "また、さまざまなアート形式（現在は陶芸）を探求したり、愛犬に背中のマッサージをしたり、ゲームナイトで兄弟姉妹とオンラインでつながったりしています。",
    "nyu": "ニューヨーク大学ティッシュ芸術学部",
    "itp": "インタラクティブテレコミュニケーション (専門職修士課程）",
    "unc": "ノースカロライナ大学チャペルヒル校",
    "psyc": "心理学（理学士）, 哲学（文学士）",
    "phil": "",
    "coding": "コーディングスキル",
    "softwares":"ソフトウェアスキル",
    "ling": "言語学（副専攻）",
    "codedIn": "Figmaでデザインし、Visual Studio Codeを使って私が開発しました。React Three Fiberで構築され、Framer MotionとGreensock Animation Platformでアニメーション化。React Routerでルーティングし、GitHub Pages経由でデプロイしました。タイポグラフィにはRobotoとRoboto Monoのフォントを使用しています。翻訳はChatGPTを通じて行われました。",
    "creativeCoding": "クリエイティブコーディング",
    "interactive": "インタラクティブ",
    "tryIt": "試してみる",
    "context":"文脈",
    "technicalDetails": "技術的詳細",
    "pet": "ペット: トビ",
    "cook": "趣味: 料理"
  },
  "project": {
    "tangibleValues": {
      "title": "具体的な価値観",
      "description": "思考実験を直接体験できるデジタルギャラリースペースで、探索と熟考のための動的な環境を提供します。",
      "altTextContext": "このプロジェクトは多くのイテレーションを経ましたが、美術館を模倣し、思考実験のプレゼンテーションに焦点を当てたかったため、ロケーションマーカーとインタラクティブなタスクを備えた小さなシーンを作ることを計画しました",
      "altTextTechnical": "2回目のイテレーションでは、決定を下した後に何が起こるのかにもっと注意を払いました。その結果、各シナリオにおける相手のコンピュータ生成アクションに基づいたアニメーションが作成されました。",
      "summary": "私は考えすぎる人間ですが、それは主に考えることが好きだからです。このプロジェクトを通じて、私が好きなことの一部を共有し、さまざまなことを考えるスペースを作りたいと思いました。このプロジェクトは、4つの思考実験を展示し、それぞれの実験のプロンプトに基づいて行動する機会を提供する3D要素を持つインタラクティブなウェブサイトです。<br /><br />入り口のホワイエを通り過ぎると、独裁者ゲームを通じて示されるオンボーディング体験に出会います。完了後、ボランティアのジレンマ、交換ゲーム、信頼ゲームを提示するエリアを自由に移動することをお勧めします。それぞれのエリアでは、浮遊するダイヤモンドが接触点となり、そのエリアの思考実験プロンプトを明らかにし、対応するインタラクティブコンポーネントを完了するための指示を伝えます。<br /><br />このプロジェクトの目標は、思考実験の体験をより魅力的なものにすることです。それは、書かれたテキストにインタラクティブ性を追加し、デジタル領域でこの体験を視覚的に示し、行動で表現することに焦点を当てています。行動をより具体化することで、人々が何を大切にしているのか、その行動の背後にある可能性のある理由についての反省を促したいと考えています。",
      "context": "私が行動する理由は何でしょうか？行動の背後にある動機を深く考えることは、自己理解の手段として、私のアイデンティティと傾向を伝え、私が存在する一瞬一瞬の一時性を示しています。そのため、私のプロジェクトにそのプロセスの一部を取り入れ、人々とそのような思考を共有できることに喜びを感じます。<br /><br />私は実験的なゲームや思考上のジレンマに特に興味を持っています。これらはさまざまな文脈に適用可能な論理の基本単位を含んでおり、軽いタッチの仮想的なプレゼンテーションを通じて人についての洞察を与えてくれます。思考実験が描写される制御された環境は、意思決定に影響を与える状況的要因やその他の説得力のある文脈の影響を最小限に抑えます。その結果、これらの決定は私たちの内部信念をより正確に反映し、通常は行動として現れます。<br /><br />ただし、このプロジェクトの焦点は、思考実験に関与する人々が体験することをより充実させることです。関与を改善するために私が行った実装は、従来のテキストにインタラクティブ性を追加し、デジタル領域でこの体験を視覚的に示し、行動で表現することに集中しています。行動を具象化することにより、シナリオを考える際に保持される価値観に具体性を与えることができます。",
      "technical": "このプロジェクトはReact Three Fiberで書かれており、React Three Rapier物理ライブラリを使用しています。アニメーションはGSAPで処理されています。読み込み画面はGLSLで記述されています。この体験では3人称視点が採用されており、主な操作方法はキーボード操作で、いくつかのマウスインタラクティブ性も含まれています。"
    },
    "socialTrolley": {
      "title": "ザ・ソーシャル・トロリー",
      "description": "トロリー問題に基づいた3つの社会的状況を、功利主義と義務論の枠組みで探るウェブ体験。",
      "altTextContext": "各社会的状況は、さまざまなタイプの関係における協力の課題を検討します。Jira、Apple Messages、Microsoft Outlookからの参照を取り入れ、現代のデジタル環境に特徴的な社会的側面を強調したいと考えました。",
      "altTextTechnical": "最初の状況では、職場のダイナミクスにおける搾取、公正な分配、責任の取り扱いを問います。2番目の状況では、拒絶、判断、信頼について考察します。3番目の状況では、内集団と外集団の識別に基づく正直さと青い嘘を調べます。",
      "summary": "『ザ・ソーシャル・トロリー』は、フィリッパ・フットによって提唱されたトロリー問題に基づく3つの社会的状況を探るウェブ体験です。功利主義と義務論の枠組みを使用して、提示された状況情報に対する意思決定が促されます。体験は、トロリー問題の簡略化されたナレーションから始まり、各社会的状況の概念化で締めくくられます。y2kレトロのウィンドウとピクセルアートのディテールで包まれ、異なる段階の対人関係における協力の課題と対立の原因が提示されます。",
      "context": "このプロジェクトは、私たちの社会的原則と道徳的信念との関係を調査することを目的としています。特に、社会的状況での行動理由が道徳的状況での行動と似ているかどうか、また私たちの社会的原則に道徳的な基盤があるのかを明らかにしたいと考えています。体験では、社会的状況において一方の行動が他方よりも社会的に受け入れられるかどうかを評価しながら、意思決定における自分自身の社会的原則に関わることになります。",
      "technical": "このプロジェクトはp5.jsで書かれており、p5.playの物理ライブラリを使用しています。主なインタラクション方法はマウスによる操作です。"
    },
    "howAreYou": {
      "title": "ハウ・アー・ユー",
      "description": "エレベーターの中でドアマンと交わす軽い会話。「こんにちは、お元気ですか？」、「元気です、あなたは？」",
      "altTextContext": "このプロジェクトは、私の教授がアパート見学の際にエレベーターでドアマンがいることを話したことに触発され、そのイメージをエレベーターオペレーターに中心を合わせて作りました。メインの画像はPixlrでテキストプロンプトとアイソメトリックアートスタイルのプリセットを使用して生成されました。",
      "altTextTechnical": "最初、このプロジェクトは3つの異なるテキスト分析プロセスを組み合わせたものでした。しかし、インタラクションデザインはストーリーに沿って進行し、視覚の背後に何があるのかに興味を持つようになりました。そのため、思考の泡が表示されるチャットとチャット生成の接続点として機能しました。",
      "summary": "このプロジェクトは、エレベーターの中でドアマンが「こんにちは、お元気ですか？」と尋ねるAI生成画像のシーンから始まります。このシーンには思考の泡が含まれ、ドアマンが何を考えているかが明らかにされ、3つのインタラクションボタン「返答」、「フォローアップ」、「無視」が表示されます。ドアマンに返答を選択すると、テキストフィールドが表示され、あなたの内心が反映されたメモが表示されます。最初のやり取りが終わると、フォローアップを選んで「次はどう言おうか？会話を続けよう！」と考えることができます。逆に、無視することを選ぶと、「何も聞こえないふりをして、誰もいないように振る舞います。エレベーターボタンを押しに行く→」となります。<br /><br />返答ルートでは、ドアマンがどんな調子かを伝えます。その返答は、過去の返答からマルコフ連鎖で生成され、大規模言語モデル（LLM）で再フォーマットされます。生成されたマルコフは、ドアマンが発言するチャットバブルに思考として表示されます。フォローアップアクションでは、ドアマンが同じように感じている他の人々を紹介して共感します。その返答は、過去の返答を検索し、あなたのものと最も似ているものを埋め込みを使って検索し、取得されます。最後のオプション、無視では、過去の返答をクラスタリングしてエレベーターボタンとして表示され、ホバーやクリックで選択できます。体験を通して、ドアマンの思考の泡が、ドアマンの生成された行動の内面を示す窓として機能します。",
      "context": "ニューヨークに住んでいると、これまで住んできた2つのアパートで共通して感じたことが、ドアマンの存在です。ドアマンとのやり取りを通じて、私は「お元気ですか？」という質問に対する意識が高まりました。この「お元気ですか？」という質問に対する返答を意識的に考え始め、私はこのプロジェクトを発案しました。<br /><br />特に、私は人々がどう返答するのかに興味があります。人々は「元気です」とだけ答えるのでしょうか？それとも返答は認識の表現、人工的な前面の提示、境界の維持、あるいはその日の本物の一部なのでしょうか？表現する際、フォーカスは否定的、肯定的、予期しない、または顕著な瞬間にあるのでしょうか？<br /><br />このプロジェクトは、私のように「どう答えるべきか」と感じている人々に対し、遊び心とカジュアルな挨拶の交換を提供します。",
     "technical": "このプロジェクトはNode.jsで書かれ、Expressを使用しています。レスポンスはReplicateのllama-2-7b-chat APIで再フォーマットされます。情報取得はnateraw/bge-large-en-v1.5モデルとHugging FacesのTransformers.jsで行われます。主なインタラクション方法はマウスとキーボード入力です。"
    },
    "gallery": {
      "title": "ギャラリー",
      "description": "追加のプロジェクトについての簡単な概要。"
    }
  },
  "galleryProject": {
    "populationFlocking": {
      "title":"ポピュレーションフロッキング",
      "description":"星が群れを成し、成長し、消滅する自己伝播型ビジュアルで、クレイグ・レイノルズのフロッキングシミュレーション、ジョン・ホートン・コンウェイの『ライフゲーム』、および遺伝的アルゴリズムに触発されています。<br /><br />最初は星がランダムに画面を埋め尽くします。次に、星たちは集まり始め、群れを形成し、一緒に移動します。しかし、グループ内に星が多すぎる場合、そのグループは過密状態となり、星たちはそのグループから離れる傾向があります。一方で、グループ内の星が少なすぎる場合、そのグループは過疎状態となり、星たちは周囲の星に引き寄せられるようになります。<br /><br />また、各星にはライフフォース（生命力）があり、過密状態や過疎状態では減少し、安定したグループ内では時間とともに増加します。星が一定期間フルヘルスの状態を維持すると、新しい星が近くに誕生します。一方で、生命力を失った星は燃え尽き、消滅します。<br /><br />時間が経つにつれ、星たちは人口状態間のナビゲーション方法を学び、長寿の星が新しい世代に過密状態からの分離や過疎状態で他の星を見つける方法についての情報を引き継ぎます。<br /><br />私は人間の行動を研究することに常に興味を持っており、このような概念にすぐに引き込まれました。ライフゲームでは、簡単なルールが自己伝播的で周期的な性質を持つ強固で魅力的な結果を生み出します。これらのルールは人口レベルを自己修正するダイナミクスを捉えており、ルールが柔軟に構造化されているため、人間の行動の他の要素を含む関係性を広げることが可能に思われました。このプロジェクトは、そのような探求への試みです。"
    },
    "movingGradient": {
      "title":"ムービンググラデーション",
      "description":"歩行者の検出と移動位置に反応するビジュアルインスタレーション。各人に対して3つのパーティクルセットが作成され、その人の空間内での位置に応じて色が変化し、その人を追尾します。その結果、異なる個人間の独立した相互作用を描いた調和した色のグラデーションが生成されます。<br /><br />ムービンググラデーションは、リニアグラデーションを変更し、グラデーションのセグメントを処理して合成された色と対応する音符を投影するという以前の2つのプロジェクトの相互作用に触発されました。この組み合わせから、異なるオブジェクトと個別に相互作用する2人がどのように相互作用を形成できるかに興味を持つようになりました。このプロジェクトでは、環境によって促進される相互作用のフィードバックループを、より遊び心のある方法で探求することを目指しました。"
    },
    "stainedGlass": {
      "title":"ステンドグラス",
      "description":"ステンドグラスを通過する光の粒子をシミュレートし、視界から徐々に消える前に色の流れをエミュレートします。<br /><br />粒子は一定間隔でエミッターから放出され、最寄りのガラスパネルに向かう力が加わります。交差すると、粒子はそのガラスパネルの色を取得し、寿命を減少させ、最終的に消えます。"
    },
    "grayscaleFilter": {
      "title":"グレースケールフィルター",
      "description":"赤と緑の値を組み合わせて検出する輝度グレースケールとコントラスト、およびソーベルエッジ検出。<br /><br />インタラクティブに色をビジュアルに戻すことも追加したかったため、マウスでドラッグすると、オリジナルのカメラの色を持つ断片がカラーリングされます"
    },
    "nypdBot": {
      "title":"NYPDボット",
      "description":"ニューヨーク市警察K5ロボットについてのビジュアルジャーナリズム記事で、事件を報告する際にロボットとどのように相互作用するかをデモンストレーションすることを主な目的としています。ロボットの機能的特徴を強調した後、公共感情の概要がコメントされ、ロボットに関する一般的な懸念についての言及があります。"
    },
    "inFridge": {
      "title":"インフリッジ",
      "description":"家庭の料理人が食品廃棄物を減らし食品安全を実践するのを支援するモバイルアプリ。適切な食品保存に関する情報を提供し、消費期限と家庭の在庫を追跡します。<br /><br />家庭料理人が直面する問題の1つは、不適切な食品保存による頻繁な食品の腐敗です。一見新鮮な食材が1週間以内に悪くなると、食材の鮮度を維持することが常に課題となり、食材が使用される前に悪くなる可能性が高くなります。この課題は、特に一人暮らしの人や食品砂漠に住む人にとって特に困難です。家庭で料理をする人々が食品を正しく保存し、保存した食品の消費期限を追跡するのを助けることで、消費者家庭での食品廃棄物の量を減らします。"
    },
    "fishLanterns": {
      "title":"フィッシュランタン",
      "description":"画面を横切って泳ぐ魚のランタンのパレードを擬人化したもの。<br /><br />夜市や祭りで天井から装飾的に吊るされたり陽気な人々に持ち運ばれたりする魚のランタンに触発され、ワイヤーフレームの骨組みと内部でちらつく炎を持つ中空の3Dモデルのようなセンターピースを作成しました。同様の魚のランタンが様々なサイズで浮かび上がり、虹色のライトに照らされています"
    },
    "flockingParticles": {
      "title":"フロッキングパーティクル",
      "description":"GPUコンピューティングを使用した3Dでのクレイグ・レイノルズのフロッキング行動のGLSL実装。<br /><br />このスケッチでは、粒子が群れを成し、鳥に一般的に見られるフロッキング行動をシミュレートします。フロッキング行動は、整列、結束、分離の3つの操舵力の組み合わせです。各力の重みの違いを視覚化するスライダーを含め、それぞれの力を分離して見る機会を提供しました。"
    },
    "ethicsExpress": {
      "title":"エシックスエクスプレス",
      "description":"『グッド・プレイス』で使用されたエシックスエクスプレストロリーを再現したカリフォルニアのトロリーの3Dモデル。"
    }
  }
}