{
  "role": "デザイナー / デベロッパー",
  "nyc": "ニューヨーク,",
  "home": "ホーム",
  "projects": "プロジェクト",
  "about": "アバウト",
  "homeScholar": "人生を通して、私は<b>人間行動</b>の複雑さを理解しようとする無限の好奇心を持ち続けてきました。",
  "homeCreative": "現在、この好奇心は私をクリエイティブテクノロジストへと導き、デジタルインタラクティビティを用いて<b>動機や意思決定</b>を探求しています。",
  "homeProjects": "私の最新プロジェクトは、<b>信念の伝達</b>を中心に展開されています。",
  "homeHobbies": "また、さまざまなアート形式（現在は陶芸）を探求したり、愛犬に背中のマッサージをしたり、ゲームナイトで兄弟姉妹とオンラインでつながったりしています。",
  "nyu": "ニューヨーク大学ティッシュ芸術学部",
  "itp": "インタラクティブテレコミュニケーション (専門職修士課程）",
  "unc": "ノースカロライナ大学チャペルヒル校",
  "psyc": "心理学（理学士）, 哲学（文学士）",
  "phil": "",
  "coding": "コーディングスキル",
  "softwares":"ソフトウェアスキル",
  "ling": "言語学（副専攻）",
  "code": "Figmaでデザインし、Visual Studio Codeを使って私が開発しました。React Three Fiberで構築され、Framer MotionとGreensock Animation Platformでアニメーション化。React Routerでルーティングし、GitHub Pages経由でデプロイしました。タイポグラフィにはRobotoとRoboto Monoのフォントを使用しています。",
  "tangibleValues": "具体的な価値観",
  "creativeCoding": "クリエイティブコーディング",
  "interactive": "インタラクティブ",
  "tryIt": "試してみる",
  "tangibleDesc": "思考実験を直接体験できるデジタルギャラリースペースで、探索と熟考のための動的な環境を提供します。",
  "tangibleAltCon": "このプロジェクトは多くのイテレーションを経ましたが、美術館を模倣し、思考実験のプレゼンテーションに焦点を当てたかったため、ロケーションマーカーとインタラクティブなタスクを備えた小さなシーンを作ることを計画しました",
  "tangibleAltTech": "2回目のイテレーションでは、決定を下した後に何が起こるのかにもっと注意を払いました。その結果、各シナリオにおける相手のコンピュータ生成アクションに基づいたアニメーションが作成されました。",
  "tangibleSum1": "私は考えすぎる人間ですが、それは主に考えることが好きだからです。このプロジェクトを通じて、私が好きなことの一部を共有し、さまざまなことを考えるスペースを作りたいと思いました。このプロジェクトは、4つの思考実験を展示し、それぞれの実験のプロンプトに基づいて行動する機会を提供する3D要素を持つインタラクティブなウェブサイトです。",
  "tangibleSum2": "入り口のホワイエを通り過ぎると、独裁者ゲームを通じて示されるオンボーディング体験に出会います。完了後、ボランティアのジレンマ、交換ゲーム、信頼ゲームを提示するエリアを自由に移動することをお勧めします。それぞれのエリアでは、浮遊するダイヤモンドが接触点となり、そのエリアの思考実験プロンプトを明らかにし、対応するインタラクティブコンポーネントを完了するための指示を伝えます。",
  "tangibleSum3": "このプロジェクトの目標は、思考実験の体験をより魅力的なものにすることです。それは、書かれたテキストにインタラクティブ性を追加し、デジタル領域でこの体験を視覚的に示し、行動で表現することに焦点を当てています。行動をより具体化することで、人々が何を大切にしているのか、その行動の背後にある可能性のある理由についての反省を促したいと考えています。",
  "tangibleCon1": "私が行動する理由は何でしょうか？行動の背後にある動機を深く考えることは、自己理解の手段として、私のアイデンティティと傾向を伝え、私が存在する一瞬一瞬の一時性を示しています。そのため、私のプロジェクトにそのプロセスの一部を取り入れ、人々とそのような思考を共有できることに喜びを感じます。",
  "tangibleCon2": "私は実験的なゲームや思考上のジレンマに特に興味を持っています。これらはさまざまな文脈に適用可能な論理の基本単位を含んでおり、軽いタッチの仮想的なプレゼンテーションを通じて人についての洞察を与えてくれます。思考実験が描写される制御された環境は、意思決定に影響を与える状況的要因やその他の説得力のある文脈の影響を最小限に抑えます。その結果、これらの決定は私たちの内部信念をより正確に反映し、通常は行動として現れます。",
  "tangibleCon3": "ただし、このプロジェクトの焦点は、思考実験に関与する人々が体験することをより充実させることです。関与を改善するために私が行った実装は、従来のテキストにインタラクティブ性を追加し、デジタル領域でこの体験を視覚的に示し、行動で表現することに集中しています。行動を具象化することにより、シナリオを考える際に保持される価値観に具体性を与えることができます。",
  "tangibleTech": "このプロジェクトはReact Three Fiberで書かれており、React Three Rapier物理ライブラリを使用しています。アニメーションはGSAPで処理されています。読み込み画面はGLSLで記述されています。この体験では3人称視点が採用されており、主な操作方法はキーボード操作で、いくつかのマウスインタラクティブ性も含まれています。"
}